"""format input"""
{
    "agents": "用于装配的智能体，主要包括人或者机器人",
    "装配目标": "装配成品的名称",
    "包含的零件": "装配所需的零件及其数量",
    "安装流程": "文本形式的装配流程"
}

""" format output"""
[
    {
        "Task": "描述分解后的每个任务的具体信息，通常是单个零件的安装",
        "Subtasks": [
            {
                "role": "根据子任务特点来选择执行对象：人或机器人",
                "objs": ["工步涉及的零件a", "工步涉及的工具a", "..."],
                "info": "描述任务中每个子任务的具体信息，通常单个具体操作",
            },
        ],
    },
]

""" example """
{
    "agents": "人和六自由度的桌面机器人",
    "装配目标": "卫星组件",
    "包含的零件": "1个框架，1个电池，1个信息转接板，4个桁条",
    "安装流程": "将2个桁条安装在框架的同一侧，分别使用2个内六角螺钉与框架固定。将1个电池放置移动至框架内部，使用2个内六角螺钉分别与已安装的两个桁条固定。将2个桁条安装在框架的另一侧，分别使用2个内六角螺钉与框架固定。使用2个内六角螺钉将电池与新的2个桁条固定。将信息转接板安装在框架一侧，使用6个一字螺钉将其与框架固定"
}

[
    {
        "Task": "安装桁条1",
        "Subtasks": [
            {
                "role": "机器人",
                "objs": ["桁条1", "框架"],
                "info": "拿起桁条1，移动到待安装的位置",
            },
        ],
    },
]